; domain
(define (domain spanner)
(:requirements :strips :typing :negative-preconditions)
(:types
location T1 - object
nut spanner man - T1
)
(:predicates
	(at ?x1 - T1 ?x2 - location)
	(carrying ?x1 - man ?x2 - spanner)
	(useable ?x1 - spanner)
	(loose ?x1 - nut)
	(tightened ?x1 - nut)
	(link ?x1 - location ?x2 - location)
)
(:action walk
	:parameters (?x1 - location ?x2 - location ?x3 - man )
	:precondition (and
	(at ?x3 ?x1)
	(link ?x1 ?x2)
	(not(at ?x3 ?x2)))
	:effect (and
	(not(at ?x3 ?x1))
	(at ?x3 ?x2))
)
(:action pickup_spanner
	:parameters (?x1 - location ?x2 - spanner ?x3 - man )
	:precondition (and
	(at ?x3 ?x1)
	(at ?x2 ?x1)
	(not(carrying ?x3 ?x2))
	(useable ?x2))
	:effect (and
	(not(at ?x2 ?x1))
	(carrying ?x3 ?x2))
)
(:action tighten_nut
	:parameters (?x1 - location ?x2 - spanner ?x3 - man ?x4 - nut )
	:precondition (and
	(at ?x3 ?x1)
	(carrying ?x3 ?x2)
	(loose ?x4)
	(at ?x4 ?x1)
	(useable ?x2)
	(not(tightened ?x4)))
	:effect (and
	(not(loose ?x4))
	(not(useable ?x2))
	(tightened ?x4))
)
)

; problem
(define (problem instance15) (:domain spanner) (:objects 
     bob - man
 spanner1 spanner2 spanner3 spanner4 spanner5 spanner6 spanner7 spanner8 spanner9 spanner10 - spanner
     nut1 nut2 nut3 nut4 nut5 nut6 nut7 nut8 - nut
     location1 location2 location3 location4 location5 location6 location7 location8 location9 location10 - location
     shed gate - location
    ) (:init 
    (at bob shed)
    (at spanner1 location10)
    (useable spanner1)
    (at spanner2 location4)
    (useable spanner2)
    (at spanner3 location2)
    (useable spanner3)
    (at spanner4 location10)
    (useable spanner4)
    (at spanner5 location5)
    (useable spanner5)
    (at spanner6 location4)
    (useable spanner6)
    (at spanner7 location5)
    (useable spanner7)
    (at spanner8 location3)
    (useable spanner8)
    (at spanner9 location9)
    (useable spanner9)
    (at spanner10 location4)
    (useable spanner10)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (loose nut3)
    (at nut3 gate)
    (loose nut4)
    (at nut4 gate)
    (loose nut5)
    (at nut5 gate)
    (loose nut6)
    (at nut6 gate)
    (loose nut7)
    (at nut7 gate)
    (loose nut8)
    (at nut8 gate)
    (link shed location1)
    (link location10 gate)
    (link location1 location2)
    (link location2 location3)
    (link location3 location4)
    (link location4 location5)
    (link location5 location6)
    (link location6 location7)
    (link location7 location8)
    (link location8 location9)
    (link location9 location10)
) (:goal
  (and
   (tightened nut1)
   (tightened nut2)
   (tightened nut3)
   (tightened nut4)
   (tightened nut5)
   (tightened nut6)
   (tightened nut7)
   (tightened nut8)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 8
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 8
3. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 8
4. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 8
5. (pickup_spanner location4 spanner10 bob)
   deleted: (at spanner10 location4)
   added: (carrying bob spanner10)
   goals met: 0 of 8
6. (pickup_spanner location4 spanner2 bob)
   deleted: (at spanner2 location4)
   added: (carrying bob spanner2)
   goals met: 0 of 8
7. (pickup_spanner location4 spanner6 bob)
   deleted: (at spanner6 location4)
   added: (carrying bob spanner6)
   goals met: 0 of 8
8. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 8
9. (pickup_spanner location5 spanner5 bob)
   deleted: (at spanner5 location5)
   added: (carrying bob spanner5)
   goals met: 0 of 8
10. (pickup_spanner location5 spanner7 bob)
   deleted: (at spanner7 location5)
   added: (carrying bob spanner7)
   goals met: 0 of 8
11. (walk location5 location6 bob)
   deleted: (at bob location5)
   added: (at bob location6)
   goals met: 0 of 8
12. (walk location6 location7 bob)
   deleted: (at bob location6)
   added: (at bob location7)
   goals met: 0 of 8
13. (walk location7 location8 bob)
   deleted: (at bob location7)
   added: (at bob location8)
   goals met: 0 of 8
14. (walk location8 location9 bob)
   deleted: (at bob location8)
   added: (at bob location9)
   goals met: 0 of 8
15. (pickup_spanner location9 spanner9 bob)
   deleted: (at spanner9 location9)
   added: (carrying bob spanner9)
   goals met: 0 of 8
16. (walk location9 location10 bob)
   deleted: (at bob location9)
   added: (at bob location10)
   goals met: 0 of 8
17. (pickup_spanner location10 spanner1 bob)
   deleted: (at spanner1 location10)
   added: (carrying bob spanner1)
   goals met: 0 of 8
18. (pickup_spanner location10 spanner4 bob)
   deleted: (at spanner4 location10)
   added: (carrying bob spanner4)
   goals met: 0 of 8
19. (walk location10 gate bob)
   deleted: (at bob location10)
   added: (at bob gate)
   goals met: 0 of 8
20. (tighten_nut gate spanner1 bob nut1)
   deleted: (loose nut1) (useable spanner1)
   added: (tightened nut1)
   goals met: 1 of 8
21. (tighten_nut gate spanner10 bob nut2)
   deleted: (loose nut2) (useable spanner10)
   added: (tightened nut2)
   goals met: 2 of 8
22. (tighten_nut gate spanner2 bob nut3)
   deleted: (loose nut3) (useable spanner2)
   added: (tightened nut3)
   goals met: 3 of 8
23. (tighten_nut gate spanner4 bob nut4)
   deleted: (loose nut4) (useable spanner4)
   added: (tightened nut4)
   goals met: 4 of 8
24. (tighten_nut gate spanner5 bob nut5)
   deleted: (loose nut5) (useable spanner5)
   added: (tightened nut5)
   goals met: 5 of 8
25. (tighten_nut gate spanner6 bob nut6)
   deleted: (loose nut6) (useable spanner6)
   added: (tightened nut6)
   goals met: 6 of 8
26. (tighten_nut gate spanner7 bob nut7)
   deleted: (loose nut7) (useable spanner7)
   added: (tightened nut7)
   goals met: 7 of 8
27. (tighten_nut gate spanner9 bob nut8)
   deleted: (loose nut8) (useable spanner9)
   added: (tightened nut8)
   goals met: 8 of 8
